-- Добавление пользователя
INSERT INTO "User" (id, name, age, password, photo)
VALUES (1, 'Алексей Ващенков', 20, '2459', '');

-- Добавление категорий
INSERT INTO "Category"
VALUES (1, 'Завтрак', '#FF5733', 1),
       (2, 'Обед', '#33FF57', 1),
       (3, 'Ужин', '#5733FF', 1);

-- Добавление ингредиентов
INSERT INTO "Ingredient" (id, name, unit, calories)
VALUES (1, 'Помидор', 'г', 24),
       (2, 'Огурец', 'г', 15),
       (3, 'Хлеб белый', 'шт.', 238),
       (4, 'Тунец', 'г', 184),
       (5, 'Оливковое масло', 'г', 884);

-- Добавление блюда
INSERT INTO "Dish" (id, name, photo, "categoryId", "userId")
VALUES (1, 'Греческий салат', '', 2, 1),
       (2, 'Салат с тунцом', '', 2, 1),
       (3, 'Паста с креветками', '', 3, 1),
       (4, 'Курица с макаронами', '', 2, 1);
;

-- Связь блюда с ингредиентами
INSERT INTO "DishIngredient" ("dishId", "ingredientId")
VALUES (1, 1),
       (1, 2),
       (1, 3),
       (2, 2),
       (2, 4),
       (2, 5);

-- Добавление рецепта
INSERT INTO "Recipe" (steps, "dishId")
VALUES ('1. Нарезать овощи\n2. Смешать\n3. Заправить оливковым маслом', 1),
       ('1. Нарезать овощи\n2. Добавить тунец\n3. Заправить оливковым маслом', 2);
